#-----------------------------2.2------------------------------------------
#-------------------------First task---------------------------------------
name = input("Введите имя: ")
print("Привет,", name + "!")
name2 = input("Введите второе имя: ")
print("Привет,", name2 + "!")

# Что нужно сделать
# Напишите программу для сервиса заказа билетов,
# которая запрашивает у пользователя город вылета и город прилёта.
# Затем выведите их в одну строку через тире.
# Обратите внимание на свои переменные: названия должны отражать содержимое.
user_name = input("Введите Ваше имя: ")
print("Здравствуйте, ", user_name + "!")

departure_city = input("Введите город вылета: ")
arrival_city = input("Введите город прилета: ")
info =
print(info)


#--------------Second task-----------------------------------------
my_color = 'Зелёный'
sport = 'Бег'
name = 'Иван'
print('Меня зовут')
print(name)
print('Мой любимый цвет:')
print(my_color)
print('Мой любимый вид спорта:')
print(sport)

