print('Hello World!')

#-----------------------------2.1------------------------------------------
#--------------------First task--------------------------------------------
first = "Моя первая переменная!"
second = "И не последняя!"
print(first)
print(second)

#----------------------Second task-----------------------------------------
my_color = 'Зелёный'
sport = 'Бег'
name = 'Иван'
print('Меня зовут')
print(name)
print('Мой любимый цвет:')
print(my_color)
print('Мой любимый вид спорта:')
print(sport)

#-----------------------------2.2------------------------------------------
#-------------------------First task---------------------------------------
name = input("Введите имя: ")
print("Привет,", name + "!")
name2 = input("Введите второе имя: ")
print("Привет,", name2 + "!")


#------------------------Second task--------------------------------------
sur_name = input('Введите фамилию: ')
print('Ваша фамилия - ' + sur_name + "!")

#-----------------------------2.3------------------------------------------
first_w = input("Введите первое слово: ")
second_w = input("Введите второе слово: ")
all_fs = first_w + " " + second_w
print(all_fs)

#----------------------------2.4------------------------------------------
# Практическая работа в данном разделе отсутствует.

#-----------------------------2.5----------------------------------------
#----------------------First task----------------------------------------
