# -----------------------------------3.2-------------------------------
# Задача 1. Выражения
print(6 * 39)
print(3**5)
print(-8 / -4)
print(10 / 2 + 6)

# Задача 2. Эти замечательные астрологи
first, second, third = 5, 4, 2
print("Сложение: ", first + second + third)
print("Вычитание: ", first - second - third)
print("Умножение: ", first * second * third)
print("Деление: ", first / second / third)
print("Возведение в степень: ", first**second**third)

# Задача 3. Деление на ноль
# print(65 / 0)
# Ошибка: деление на наль запрещено

#---------------------------------------3.3---------------------------
# Задача 1. Фруктовый сад
a, b, c = 8, 5, 3
print((a / (b + c) - a) / c)

# Задача 2. Автобус или метро
bus = 5
metro = 3
result = ((6 + (10 - bus)**2) / (metro + 1)) + 132 / (2 + bus)
print(result)

# Задача 3. Сложные степени
compound_degrees = (-3 + (8**2 - 12) * 4**3**2) / (2 * 18)
print(compound_degrees)

#---------------------------------------3.4---------------------------
# Задача 1. Координаты точки
a = int(input("Введите значение координаты X: "))
b = int(input("Введите значение координаты Y: "))
print("Сумма = ", a + b)

# Задача 2. Отрезок
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
c = int(input("Введите третье число: "))
d = int(input("Введите четвертое число: "))
result = 2 * (c + 5 + (a * b) / (4 * b)) * (d - 2 * (a**3 / 30)) - 10
print(result)

# Задача 3. Исправление ошибки
a = '2'
b = '5'
c = '3'
num = 6 ** int(a) + (7 - int(b)) * int(c)
print(num)

#---------------------------------------3.5---------------------------
# Задача 1. Яблоки
apples = 41
box_contain = 3
print("Потребуется ящиков: ", apples // box_contain)
print("Тон яблок останется: ", apples % box_contain)

# Задача 2. Последняя цифра
number = int(input("Введите число: "))
house = number % 10
flat = number // 10
print("Номер дома: ", house)
print("Номер квартиры: ", flat)

# Задача 3. Спортсмены
total_meter = int(input("Сколько всего метров Вы уже пробежали? "))
circle = total_meter // 100
meter = total_meter % 100
print("Cпортсмен пробежал ", circle, " кругов и ", meter, " метров.")

#---------------------------------------3.7---------------------------
# Задача 7
# Необходимо вывести четырехзначное число отдельными цифрами в строку и составить число наоборот (задом наперед)
num = int(input("Введите четырехзначное число: "))
first_dig = num // 1000
second_dig = num % 1000 // 100
third_dig = num % 100 // 10
fourth_dig = num % 10
print(first_dig, second_dig, third_dig, fourth_dig)
revers_num = fourth_dig * 1000 + third_dig * 100 + second_dig * 10 + first_dig
print(revers_num)


# Задача 8
# Необходимо поменять значения целочисленных переменных местами без использования третьей переменной и синтаксического
#сахара

a = int(input("Введите первое целое число: "))
b = int(input("Введите второе целое число: "))
print(a, b)
a += b
b = a - b
a -= b
print(a, b)
